---
kind: type
id: T:Autodesk.Revit.DB.IntersectionResultArrayIterator
source: html/87690604-accc-59bb-3b4e-a70c1f40ec0c.htm
---
# Autodesk.Revit.DB.IntersectionResultArrayIterator

An iterator to a array.

## Syntax (C#)
```csharp
public abstract class IntersectionResultArrayIterator : APIObject,
	IEnumerator
```